12/data/attachments/31a8da8b9a94d4e2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Danielle_student_Actions_52958_4</nif:username>
            <nif:friendToBeRequested>soap_actions_205a02d0-187f-490f-ac10-52878a534df2</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>